Repository: bit-part/craftcms_docs-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: If you want to find elements related to a source element through a Matrix field, just pass the Matrix field’s handle to the field parameter.
ja: 行列フィールド内のソースエレメントに関連するエレメントを見つけたい場合、行列フィールドのハンドルを field パラメータに渡します。

source: If you want to keep your current directory structure…
ja: 既存のディレクトリ構成を維持したい場合は

source: If you want to log any messages in your migration code, echo it out rather than calling Craft::info():
ja: マイグレーションコード内でメッセージを記録したい場合、Craft::info() を呼び出すよりも echo で出力してください。

source: If you want to loop through elements linearly, use Twig’s `{% for %}` tag instead.
ja: エレメントを直線的にループしたい場合、代わりに Twig の `{% for %}` を使ってください。

source: If you want to loop through elements linearly, use Twig’s for tag instead.
ja: エレメントを直線的にループしたい場合、代わりに Twig の for タグを使ってください。

source: If you want to make it possible to revert your migration, safeDown() is where the reversion code goes.
ja: マイグレーションを元に戻せるようにしたい場合、safeDown() が復帰コードを記入する場所になります。

source: If you want to match URIs that look like news/archive/2017, you type news/archive/ into the URI field, and then click on the “year” token.
ja: news/archive/2017 のような URI とマッチさせる場合、URI フィールドに news/archive/ と入力し、“year” トークンをクリックします。

source: If you want to set a param value to an array, you now must type out the array brackets.
ja: パラメータ値を配列にセットする場合、配列の大括弧を記述しなければなりません。

source: If you want to show some additional HTML surrounding the children, but only in the event that the element actually has children, wrap your {% children %} tag with {% ifchildren %} and {% endifchildren %} tags.
ja: エレメントが実際に子を持っているときだけ、子を取り囲む追加 HTML を表示したい場合、{% children %} タグを {% ifchildren %} と {% endifchildren %} タグで囲みます。

source: If you want to use a relative file system path, note that it should be relative from the directory that holds your index.php file.
ja: ファイルシステムの相対パスを使用する場合、index.php ファイルを保持するディレクトリからの相対パスでなければならないことに注意してください。

source: If you want your directory structure to resemble a new Craft 3 project…
ja: 新しい Craft 3 プロジェクトのようなディレクトリ構造にしたい場合は

source: If you want your entries to have auto-generated titles rather than requiring authors to enter them, you can uncheck the “Show the Title field?” checkbox.
ja: 投稿者に入力を求めるのではなく、自動生成されたタイトルにする場合、「タイトルのフィールドを見る。」チェックボックスをオフにします。

source: If you want your form to allow multiple files being uploaded at once, just add the multiple attribute, make sure that the input name ends in “[]”:
ja: 一度に複数ファイルをアップロードできるようにするには、multiple 属性を追加し、input 名の最後が [] であることを確認します。

source: If you would like the section's content to be separate then disable this option for that section.
ja: セクションのコンテンツをサイトごとに分離したい場合、そのセクションにあるこのオプションを無効にします。

source: If you would prefer to define volume settings with a config file, you can do that from config/volumes.php.
ja: 設定ファイルでボリューム設定を定義することを好む場合、config/volumes.php で設定できます。

source: If you're familiar with Craft already but don't know where to start when it comes to moving to Craft 3, start with the Changes in Craft 3 documentation.
ja: Craft 自体には慣れ親しんでいるものの、Craft 3 に移行するにあたって何から始めたらよいか判らないのであれば、Craft 3 の変更点ドキュメントからスタートしてください。

source: If you're new to Craft and want to get the bigger picture, start with About Craft CMS.
ja: 新しく Craft に触れ、かつ、全体像を知りたいのであれば、Craft CMS についてから始めてください。

source: If you're using Craft with multiple sites then you can also define in your Section:
ja: Craft のマルチサイト機能を利用しているなら、次のこともセクションで定義できます。

source: If your Assets field is only meant to have a single asset selected, remember that calling your Assets field will still give you the same ElementCriteriaModel, not the selected asset.
ja: 意図的にアセットフィールドへ1つだけセットしている場合でも、アセットフィールドを呼び出すと、選択されたアセットではなく、同じ ElementCriteriaModel として提供されることを覚えておいてください。

source: If your Categories field is only meant to have a single category selected, remember that calling your Categories field will still give you the same ElementCriteriaModel, not the selected category.
ja: 意図的にカテゴリフィールドへ1つだけセットしている場合でも、カテゴリフィールドを呼び出すと、選択されたカテゴリではなく、同じ ElementCriteriaModel として提供されることを覚えておいてください。

source: If your Craft installation has multiple sites, then you can target locale specific routes via:
ja: インストールした Craft に複数のサイトがある場合、ルートにターゲットのロケールを指定することもできます。

source: If your Craft project is being developed by multiple people, or has been deployed in multiple environments, managing structural changes can become a little cumbersome, as you try to keep all environments in sync with each other.
ja: Craft プロジェクトが複数の人々によって開発されている場合、または複数の環境で開発されている場合、すべての環境を互いに同期させようとすると、構造の変更を管理するのが少し面倒になることがあります。

source: If your Entries field is only meant to have a single entry selected, remember that calling your Entries field will still give you the same ElementCriteriaModel, not the selected entry.
ja: 意図的にエントリフィールドへ1つだけセットしている場合でも、エントリフィールドを呼び出すと、選択されたエントリではなく、同じ ElementCriteriaModel として提供されることを覚えておいてください。

source: If your Tags field is only meant to have a single tag selected, remember that calling your Tags field will still give you the same ElementCriteriaModel, not the selected tag.
ja: 意図的にタグフィールドへ1つだけセットしている場合でも、タグフィールドを呼び出すと、選択されたタグではなく、同じ ElementCriteriaModel として提供されることを覚えておいてください。

source: If your Users field is only meant to have a single user selected, remember that calling your Users field will still give you the same ElementCriteriaModel, not the selected user.
ja: 意図的にユーザーフィールドへ1つだけセットしている場合でも、ユーザーフィールドを呼び出すと、選択されたユーザーではなく、同じ ElementCriteriaModel が提供されることを覚えておいてください。

source: If your plugin has a Control Panel section, you can also give its global nav item a custom icon by saving an icon-mask.svg file in the root of your plugin’s source directory.
ja: プラグインが コントロールパネルのセクション を持つ場合は、プラグインのソースディレクトリのルートに icon-mask.svg ファイルを保存することによって、グローバルナビゲーション項目にカスタムアイコンを付けることもできます。

source: If your server is configured to support PATH_INFO, you can set this to true.
ja: サーバーが PATH_INFO をサポートするよう設定されているならば、ここに true をセットできます。

source: If your server is running Apache, you can do this by creating a .htaccess file within it, with the contents Deny from all.
ja: サーバーが Apache を実行している場合、ディレクトリ内に .htaccess ファイルを作成し、内容を Deny from all としてください。

source: If your site has a different language than your default language then you will need to set each field as Translatable (by site, by language, or site group).
ja: サイトがデフォルトの言語と異なる言語を持つ場合、それぞれのフィールドを（サイト、言語、またはサイトグループに対して）翻訳可能に設定する必要があります。

source: If your web host already has a public HTML folder setup to for you that you cannot rename, then you can just copy the contents of Craft’s web folder to it and use your host’s default public HTML folder.
ja: ウェブホストがリネームできない公開ディレクトリが設定されているのであれば、Craft の web フォルダのコンテンツをコピーして、目的のホストのデフォルトの公開ディレクトリを利用します。

source: If you’d like, you can set the alias values with environment variables, either from your .env file or somewhere in your environment’s configuration:
ja: 必要であれば、.env ファイルや環境設定のどこかで、環境変数のエイリアス値をセットすることができます。

source: If you’d prefer to show more or less, just change the numbers that are passed into getPrevUrls() and getNextUrls().
ja: 多かれ少なかれ表示することを望むなら、getPrevUrls() と getNextUrls() に渡す数値を変更してください。

source: If you’re a glutton for punishment and want your website to look flawless on IE 6, that’s your choice.
ja: もしあなたがつらい仕事を苦にせず、IE 6 で完璧に表示されるサイトを望むのであれば、あたなの望む通りにできます。

source: If you’re getting a 404, your server might not be configured to redirect would-be 404’s to index.php correctly.
ja: 404 が表示される場合、サーバーが 404 を index.php に正しくリダイレクトするよう設定できていないかもしれません。

source: If you’re getting other errors then you should revisit the prior steps to ensure everything is set up properly.
ja: もし他のエラーが表示されているのであれば、事前のステップですべての設定が適切に行われているかどうか再確認してください。

source: If you’re given a choice, we recommend the following database settings in most cases:
ja: 選択可能であれば、ほとんどの場合に次のデータベース設定を推奨します。

source: If you’re new to Twig, be sure to read through our documentation to familiarize yourself with its syntax.
ja: Twig をはじめて使う方は、その構文に慣れ親しむためにドキュメントへ目を通してください。

source: If you’re not directly outputting the value of the field, like assigning it to a variable for example, you will need to use dropdownFieldHandle.value, like so:
ja: 例えば、変数に割り当てるなどフィールドの値を直接出力しない場合、次のように dropdownFieldHandle.value を利用する必要があります。

source: If you’re not sure and like to live life on the edge, use 777.
ja: 確信が持てず、緊張感がある生活を好むなら、777 を利用します。

source: If you’re not using MAMP or another localhosting tool, you will probably need to update your hosts file, so your computer knows to route requests to your chosen host name to the local computer.
ja: MAMP や他のローカルホスティングツールを使用していない場合、hosts ファイルを更新して、選択したホスト名にローカルコンピュータへ要求をルーティングする必要があるかもしれません。

source: If you’re ready to publicly release your plugin, register it as a new Composer package on Packagist.
ja: プラグインを一般公開する準備ができたら、新しい Composer パッケージを Packagist に登録してください。

source: If you’re running a multi-language site with Craft you have the option to mark the field as translatable.
ja: Craft で多言語サイトを運用している場合、フィールドを翻訳可能にするオプションがあります。

source: If you’re running multiple sites with Craft, you can create site-specific subdirectories in your craft/templates/ directory, which contain templates that will only be available to a specific site.
ja: Craft でマルチサイトを運用している場合、特定のサイトだけで利用可能なテンプレートを含むサイト固有のサブディレクトリを craft/templates/ 内に作成できます。

source: If you’re unfamiliar with Composer, it’s a package manager (like npm) that attempts to make installing and updating PHP libraries easy via terminal commands.
ja: Composer に不慣れであれば、PHP ライブライのインストールやアップデートをターミナルコマンドによって容易にすることを目指す（npm のような）パッケージマネージャーと考えてください。

source: If you’re using Craft’s Composer starter project, then it is the web/ directory by default, but it can be renamed to anything you want as long as your web server is configured to point to it.
ja: Craft の Composer スタータープロジェクトを利用しているのであれば、ドキュメントルートはデフォルトで web/ ディレクトリになりますが、ウェブサーバーで設定されている範囲においてリネームすることもできます。

source: If you’re using the {% switch %} tag inside of a {% for %} loop, you won’t be able to access Twig’s loop variable directly inside of the {% switch %} tag.
ja: {% for %} ループ内で {% switch %} タグを使う場合、{% switch %} タグの内側で Twig の ループ変数 に直接アクセスすることはできません。

source: If you’ve already got a hold of the source element in your template, like in the example below where we're outputting the Drink entry, you can access its target elements for a particular field in the same way you access any other field’s value: by the handle.
ja: 「ドリンク」エントリを出力している以下の例のように、すでにテンプレート内でソースレメントを保持している場合、他のフィールドの値にアクセスするのと同じ方法、すなわちハンドルによって、特定のフィールドのターゲットエレメントにアクセスできます。

source: If you’ve done everything right so far, you should be greeted by Craft’s Setup Wizard.
ja: ここまでのステップがうまくいっていれば、Craft のセットアップウィザードが迎えてくれるでしょう。

source: If/when Twig gets to it, the login enforcement will take place.
ja: Twig がそれに到達すると、ログインが強制されます。

source: Image Format can be set to the following values:
ja: 画像フォーマット には、次の値をセットできます。

source: Image Format – the transform’s resulting image format
ja: 画像フォーマット – 変換結果の画像フォーマット

source: Image Transforms
ja: 画像の変形

source: Image transform indexes can be eager-loaded on assets that are also eager-loaded:
ja: イメージ変換インデックスは、eager-loaded されるアセットにも eager-loaded できます。

source: ImageMagick is preferred.
ja: ImageMagick が好ましいです。

source: Immediately after typing “{% redirect”, you need to tell the tag where to redirect the browser.
ja: 「{% redirect」と入力したすぐ後に、ブラウザがリダイレクトする場所をタグに伝える必要があります。

source: In Craft 2, each time you call a parameter-setter method (e.g. .type('article')), the method would:
ja: Craft 2 では、パラメータ設定メソッド（例：.type('article')）を呼び出すときは、次のような手順になります。

source: In Craft 3 you can host multiple websites in a single Craft installation.
ja: Craft 3では、1つインストールするだけで複数のウェブサイトをホストできます。

source: In Craft 3, your translations/ folder might look something like this:
ja: Craft 3 の translations/ フォルダの構成は、次のようになります。

source: In Craft, you define your site’s HTML output with templates.
ja: Craft では、テンプレートを利用してサイトの HTML 出力を定義します。

source: In Settings → Fields, choose the fields you want to have translatable.
ja: 「設定 > フィールド」で、翻訳可能にするフィールドを選択します。

source: In Settings → Sections, go into each section settings you want included in the localized site and enable the site in the Site Settings.
ja: 「設定 > セクション」で、ローカライズしたいサイトを含むセクションの設定に移動し、サイト設定でサイトを有効にします。

source: In addition to the core parameters, most custom fields support their own parameters as well.
ja: コアのパラメータに加えて、ほとんどのカスタムフィールドは独自のパラメータもサポートしています。

source: In addition to the template filters that Twig comes with, Craft provides a few of its own.
ja: Twig に付随するテンプレートフィルタに加えて、Craft がいくつか独自のものを提供します。

source: In addition to the template functions that Twig comes with, Craft provides a few of its own:
ja: Twig に付随するテンプレートファンクションに加えて、Craft がいくつか独自のものを提供します。

source: In addition to the template tags that Twig comes with, Craft provides a few of its own.
ja: Twig に付随するテンプレートタグに加えて、Craft がいくつか独自のものを提供します。

source: In each Section you can define the following:
ja: それぞれのセクションには、次のことを定義できます。

source: In either case, you can output an option’s label by typing {{ option.label }} instead, and you can tell if the option is selected or not via option.selected.
ja: いずれの場合も、オプションのラベルを出力するには {{ option.label }} と記述します。オプションが選択されているかどうかは option.selected で知ることができます。

source: In general, if someone asks you to stop, then stop.
ja: 一般的に、誰かがあたなにやめるよう頼んだなら、その時点でやめてください。

source: In its simplest form, you can pass in one of these things to it:
ja: 最も単純な書式としては、次のいずれかを渡すことができます。

source: In lieu of using the web browser to run the Craft installer, you can set up Craft from the command line.
ja: ウェブブラウザを利用して Craft のインストーラーを実行する代わり、コマンドラインから Craft をセットアップできます。

source: In most cases you can replace calls to .last() with .inReverse().one() and get the same result, without the extra database query.
ja: ほとんどのケースでは、.last() の呼び出しを .inReverse().one() に置き換えることで、余分なデータベースクエリを必要とせず、同じ結果を得ることができます。

source: In other words, the line above is really just a shortcut for this:
ja: 言い換えれば、上の行は次のコードのショートカットとなります。

source: In our example, we’re grabbing the first asset with entry.assetsField[0], and we’re using Twig’s null-coalescing operator (??) to define a default value (null) in case there is no related asset.
ja: この例では、最初のアセットを entry.assetsField[0] で取得しています。そして、関連付けられたアセットがない場合のデフォルト値（null）を定義するため、Twig の null 合体演算子 (??) を使っています。

source: In reality it could be entry.postDate, now, etc.)
ja: 実際には entry.postDate や now などになる可能性があります。）

source: In some cases you want a URL to load a template, but you don’t want the URI to match the template path.
ja: テンプレートを読み込むための URL が必要なものの、URI とテンプレートパスをマッチさせたくない場合があります。

source: In the page’s
ja: ページの 内

source: In the settings for each Channel Section is an option to propagate entries in that section across all sites.
ja: それぞれのチャンネルセクションの設定には、すべてのサイトにエントリを広げるためのオプションがあります。

source: In this example there is no reason to access the template directly because it's only ever used as part of an entry URL.
ja: この例では、エントリ URL の一部としてのみ利用されるため、テンプレートへダイレクトにアクセスする理由がありません。

source: In this example we’re only showing up to five page links in either direction of the current page.
ja: この例では、現在のページからいずれかの方向に5ページのリンクを表示しているだけです。

source: In this example, we'll use a template located at craft/templates/_entry.html.
ja: この例では、craft/templates/_entry.html にあるテンプレートを使用します。

source: In this short guide we'll walk through the steps of setting up a new site in Craft.
ja: これは、Craft で新しいサイトをセットアップするステップを段階的に説明するショートガイドです。

source: In those cases, you can just replace the .last() call with what it’s already doing internally:
ja: このようなケースでは、 .last() の呼び出しを内部的な処理で置き換えることができます。

source: In your templates, you can also access the language setting via craft.app.language.
ja: テンプレート内では、craft.app.language 経由で言語設定にアクセスすることもできます。

source: In your terminal, go to your Craft project and tell Composer to require your plugin.
ja: ターミナル上で Craft プロジェクトへ移動し、Composer にプラグインの追加を伝えてください。

source: In your terminal, go to your project’s root directory and run the following command to kick off the Setup Wizard:
ja: ターミナル上でプロジェクトのルートディレクトリに移動し、次のコマンドを実行してセットアップウィザードを開始します。

source: In your terminal, go to your project’s root directory and run the following command:
ja: ターミナル上でプロジェクトのルートディレクトリへ移動し、次のコマンドを実行します。

source: In your web browser, go to http:///index.php?p=admin (substituting with your web server’s host name).
ja: ウェブブラウザで http:///index.php?p=admin（新しいウェブサーバーのホスト名で を置き換える）に移動します。

source: Index Templates
ja: インデックステンプレート

source: Ingredients: Target
ja: 原材料：ターゲット

source: Input the information you saved in Step 3.
ja: ステップ3で保存した接続情報を入力してください。

source: Inside of the Sections are Entries.
ja: セクションの内側にエントリがあります。

source: Install Composer
ja: Composer のインストール

source: Installation Instructions
ja: インストールガイド

source: Installation
ja: インストール

source: Installing Craft
ja: Craft のインストール

source: Instead you must stick to the standard array syntaxes.
ja: 代わりに、あなたは標準の配列構文に耐えなければなりません。

source: Instead, focus on helping to resolve issues and learning from mistakes.
ja: その代わりに、問題を解決することを手伝って失敗から学ぶことにフォーカスしましょう。

source: Instead, you can access it like so:
ja: 代わりに、次のようにアクセスできます。

source: Instead, you should set up a new Dynamic Route.
ja: 代わりに、新しい動的なルートをセットアップしましょう。

source: Instruction text
ja: 説明

source: Integrating Disqus
ja: Disqus の統合

source: Internet Explorer 11 or later
ja: Internet Explorer 11 以降

source: Intl – Adds rich internationalization support.
ja: Intl – よりリッチな国際化のサポートを追加します。

source: Intro to Plugin Dev
ja: プラグイン開発の紹介

source: Introduction
ja: 序論

source: Is Primary Site?
ja: これはプライマリサイトですか？

source: Is it an action request?
ja: それはアクションリクエストか？

source: Is it an entry/category request?
ja: エントリ / カテゴリのリクエストか？

source: It assumes that you have a global set with the handle globals, with a field called siteDescription.
ja: siteDescription と呼ばれるフィールドを持つ、globals というハンドルのグローバルのセットがあることを前提としています。

source: It assumes that you have a global set with the handle globals, with two fields: feedAuthorName and feedAuthorEmail.
ja: feedAuthorName と feedAuthorEmail 2つのフィールドを持つ、globals というハンドルのグローバルのセットがあることを前提としています。

source: It can be overly technical at times, but we still recommend you read through it.
ja: 時として過度に専門的なところもありますが、読んでおくことをお勧めします。

source: It comes with the craft executable file, enabling various CLI features in your terminal.
ja: craft 実行可能ファイルが付属しているため、ターミナルから様々な CLI 機能を利用できます。

source: It defines sensitive or environment-specific config values that don’t make sense to commit to version control.
ja: バージョン管理でコミットする必要のない、機密性が高い、または、特定の環境に依存する設定値を定義します。

source: It does so by offering developers a high level of flexibility, both in terms of content modeling and the front-end views, while also giving content managers an intuitive authoring experience.
ja: コンテンツの運営者が直感的な編集体験をしている間でさえも、コンテンツモデルやフロントエンドの表示に関する高いレベルの柔軟性を開発者に提供します。

source: It doesn't use themes or impose any content layout or structure.
ja: テーマを使わず、また、 いかなるコンテンツレイアウトや構造を強要しません。

source: It is important that we resolve disagreements and differing views constructively.
ja: 大切なのは意見の相違や異なる視点を建設的に解決することです。

source: It should be placed right after your tag.
ja: タグの直後に配置する必要があります。

source: It should be placed right before your tag.
ja: タグの直前に配置する必要があります。

source: It should be used as a starting point for any actual .env files, stored alongside it but out of version control on each of the environments your Craft project is running in.
ja: 実際の .env ファイルの出発点として使用する必要があります。ファイルとして格納されていますが、動作している Craft プロジェクトの各環境のバージョン管理からは除外してください。

source: It still works the same, but the stripZeroCents argument has been renamed to stripZeros, and pushed back a couple notches, so you will need to update your templates if you were setting that argument.
ja: 従来と同じ動きになりますが、引数 stripZeroCents は stripZeros にリネームされ、キーと値の両方が必要となっているため、この引数をセットしている場合はテンプレートを更新する必要があります。

source: It will be appended to your base site URL.
ja: それは、ベースサイト URL に追加されます。

source: It will get instantiated at the beginning of every request.
ja: すべてのリクエスト開始時に、インスタンスが作られます。

source: It would be silly to create a new template for every year.
ja: 毎年新しいテンプレートを作成するのは、賢明とは言えません。

source: It wouldn’t hurt to take some time to read up on those concepts if you are new to Yii.
ja: あなたが Yii を初めて習得するとしても、それらのコンセプトを読み解くために時間をかけることは苦痛にならないでしょう。

source: Item name
ja: アイテム名

source: Its init() method is the best place to register event listeners, and any other steps it needs to take to initialize itself.
ja: init() メソッドはイベントリスナーやそれ自体の初期化を必要とする他のステップを登録するのに最適な場所です。

source: Its document root should point to your web/ directory (or whatever you’ve renamed it to).
ja: ドキュメントルートは web/ ディレクトリ（または、リネームしたディレクトリ）を指すようにします。

source: Its document root should point to your public HTML folder.
ja: ドキュメントルートは公開ディレクトリを指しているはずです。

source: Its options include:
ja: オプションには、次のものが含まれます。

source: It’s also possible to load nested sets of elements, using this syntax:
ja: 次の構文を利用して、エレメントの ネストされた セットを読み込むこともできます。

source: It’s important to keep in mind that Craft doesn’t actually get involved for every request that touches your server – only requests that go to your index.php file.
ja: サーバーに到達するすべてのリクエストに Craft が実際に関係しているわけではなく、index.php ファイルへのリクエストだけであると念頭におくことが重要です。

source: It’s important to remember that a community where people feel uncomfortable or threatened is not a productive one.
ja: 大切なのは、そこにいる人々が不快だったり脅されているように感じるコミュニティは生産的ではないと覚えておくことです。

source: It’s more secure, as sensitive information like database credentials are stored in .env files that aren’t committed to Git (utilizing PHP dotenv).
ja: データベースの認証情報のような機密性の高い情報は、Git にコミットしない .env ファイルに格納される（PHP dotenv を利用）ため、より安全です。

source: It’s no longer needed; Craft 3 is located in vendor/craftcms/cms/ now.
ja: それは、もはや必要ありません。Craft 3 は vendor/craftcms/cms/ に配置されています。

source: It’s required even if you don’t want to distribute your plugin via Composer.
ja: Composer 経由でプラグインを配布したくない場合でも、必要です。

source: I’m getting a “Setting unknown property: craft\config\DbConfig::initSQLs” error.
ja: 「Setting unknown property: craft\config\DbConfig::initSQLs」エラーが表示されます。

source: Just choose something that is easy to identify.
ja: 簡単に識別できるものを選んでください。

source: Just like the other field types, you can add these to your section, user, asset, category group, tag group, and global sets’ field layouts.
ja: 他のフィールドタイプと同様に、これらをセクション、ユーザー、アセット、カテゴリグループ、タググループ、およびグローバル設定のフィールドレイアウトに追加できます。

source: Just open your config/db.php file and delete the line that begins with 'initSQLs'.
ja: config/db.php ファイルを開いて、'initSQLs' から始まる行を削除してください。

source: Keyword
ja: キーワード

source: Language
ja: 言語

source: Learn more about what need to go in the volumes.php file in the Overriding Volume Settings section in the Configuration documentation.
ja: より詳しくは、コンフィギュレーションドキュメントにあるボリューム設定の上書きセクションの volumes.php ファイルを参照してください。

source: Let's review each one in more detail.
ja: それぞれについて、詳しく見てみましょう。

source: Let's say we are working on our cocktail lounge website and want to build out the Recipes section for the house drinks.
ja: わたしたちがカクテルラウンジのウェブサイトに取り組んでいて、ハウスドリンクのためのレシピセクションを作りたいとしましょう。

source: Let's say you have a cocktail lounge website with various types of content: news, events, and recipes.
ja: 様々なタイプのコンテンツ（ニュース、イベント、レシピ）を持つカクテルラウンジのウェブサイトを保有しているとします。

source: Lightswitch Fields
ja: Lightswitch フィールド

source: Lightswitch fields give you a simple toggle input for times when all you need is a “Yes” or “No” answer.
ja: Lightswitch フィールドでは、「はい」または「いいえ」の答えが必要なとき向けに、トグル入力を提供します。

source: Like Twig’s core `date` filter, but with additional support for the following format values:
ja: Twig の `date` フィルタと同様ですが、次の format 値を追加サポートしています。

source: Like Twig’s core `json_encode` filter, but if the options argument isn’t set, it will default to JSON_HEX_TAG | JSON_HEX_AMP | JSON_HEX_QUOT if the response content type is either text/html or application/xhtml+xml.
ja: Twig の `json_encode` フィルタと同様ですが、引数 options がセットされておらず、レスポンスのコンテンツタイプが text/html または application/xhtml+xml の場合、デフォルトで JSON_HEX_TAG | JSON_HEX_AMP | JSON_HEX_QUOT になります。
